In [1]:
import pandas as pd

# Create a sample DataFrame
data = {
    'Name' : ['Alice', 'Bob', 'Charlie', None, 'Eve'],
    'Age' : [25, None, 30, 22, 28],
    'Salary' : [50000, 60000, None, 45000, None]
}

# Convert into Pandas DataFrame
df = pd.DataFrame(data)

In [2]:
df

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob   NaN  60000.0
2  Charlie  30.0      NaN
3     None  22.0  45000.0
4      Eve  28.0      NaN

# Handling Null Values

In [3]:
# 1. Remove rows with any null values
df_cleaned1 = df.dropna()
df_cleaned1

    Name   Age   Salary
0  Alice  25.0  50000.0

In [4]:
# 2. Fill null values with a specific value
df_cleaned2 = df.fillna(0)
df_cleaned2

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob   0.0  60000.0
2  Charlie  30.0      0.0
3        0  22.0  45000.0
4      Eve  28.0      0.0

In [6]:
# 3. Fill null values with the mean of the column
df_cleaned3 = df.fillna(df.mean())
df_cleaned3

C:\Users\Asus\AppData\Local\Temp\ipykernel_14572\165512194.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df_cleaned3 = df.fillna(df.mean())

      Name    Age        Salary
0    Alice  25.00  50000.000000
1      Bob  26.25  60000.000000
2  Charlie  30.00  51666.666667
3     None  22.00  45000.000000
4      Eve  28.00  51666.666667

In [7]:
# 4. Forward fill
df_cleaned4 = df.ffill()
df_cleaned4

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob  25.0  60000.0
2  Charlie  30.0  60000.0
3  Charlie  22.0  45000.0
4      Eve  28.0  45000.0

In [8]:
# 5. Backward fill
df_cleaned5 = df.bfill()
df_cleaned5

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob  30.0  60000.0
2  Charlie  30.0  45000.0
3      Eve  22.0  45000.0
4      Eve  28.0      NaN

# Drop unnecessary Row or Columns

In [9]:
df = df.drop('Name',axis=1) # axis=1 means column
df

    Age   Salary
0  25.0  50000.0
1   NaN  60000.0
2  30.0      NaN
3  22.0  45000.0
4  28.0      NaN

In [10]:
df = df.drop(2)

In [11]:
df

    Age   Salary
0  25.0  50000.0
1   NaN  60000.0
3  22.0  45000.0
4  28.0      NaN

In [14]:
df.drop('Age',axis=1,inplace=True)

In [15]:
df

    Salary
0  50000.0
1  60000.0
3  45000.0
4      NaN

In [16]:
df.drop(4)

    Salary
0  50000.0
1  60000.0
3  45000.0